Tekla Open API Reference for Tekla Structures 2025
ViewBase.GetObjects Method
Overload List
Name | Description
GetObjects()
 Gets the objects in the view. Does not return child objects (single dimensions, grid lines, views).
GetObjects(Type[])
 Gets the objects in the view that are of certain types. Does not return child objects (single dimensions, grid lines, views).
Top
See Also
Reference
ViewBase Class
Tekla.Structures.Drawing Namespace